Tekla.Structures.Internal.SynchronizeInvokeFunctionality


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.#ctor(System.ComponentModel.ISynchronizeInvoke)
Instance:

Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke0``1(Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod0{``0})
Method:
Returns:

Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke1r``2(``0@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod1r{``0,``1})
P0:
Method:
Returns:

Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke1v``2(``0,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod1v{``0,``1})
P0:
Method:
Returns:

Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke2rr``3(``0@,``1@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod2rr{``0,``1,``2})
P0:
P1:
Method:
Returns:

Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke2rv``3(``0@,``1,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod2rv{``0,``1,``2})
P0:
P1:
Method:
Returns:

Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke2vr``3(``0,``1@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod2vr{``0,``1,``2})
P0:
P1:
Method:
Returns:

Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke3vvr``4(``0,``1,``2@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod3vvr{``0,``1,``2,``3})
P0:
P1:
P2:
Method:
Returns:

Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke2vv``3(``0,``1,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod2vv{``0,``1,``2})
P0:
P1:
Method:
Returns:

Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke3rrv``4(``0@,``1@,``2,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod3rrv{``0,``1,``2,``3})
P0:
P1:
P2:
Method:
Returns:

Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke3rrr``4(``0@,``1@,``2@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod3rrr{``0,``1,``2,``3})
P0:
P1:
P2:
Method:
Returns:

Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke3vvv``4(``0,``1,``2,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod3vvv{``0,``1,``2,``3})
P0:
P1:
P2:
Method:
Returns:

Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke4vvrr``5(``0,``1,``2@,``3@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod4vvrr{``0,``1,``2,``3,``4})
P0:
P1:
P2:
P3:
Method:
Returns:

Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke4rrrr``5(``0@,``1@,``2@,``3@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod4rrrr{``0,``1,``2,``3,``4})
P0:
P1:
P2:
P3:
Method:
Returns:

Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke5rrrrr``6(``0@,``1@,``2@,``3@,``4@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod5rrrrr{``0,``1,``2,``3,``4,``5})
P0:
P1:
P2:
P3:
P4:
Method:
Returns:

Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke5rrvvv``6(``0@,``1@,``2,``3,``4,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod5rrvvv{``0,``1,``2,``3,``4,``5})
P0:
P1:
P2:
P3:
P4:
Method:
Returns:

Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke9rrrrrrrrr``10(``0@,``1@,``2@,``3@,``4@,``5@,``6@,``7@,``8@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod9rrrrrrrrr{``0,``1,``2,``3,``4,``5,``6,``7,``8,``9})
P0:
P1:
P2:
P3:
Method:
Returns:

Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke6vvvrrr``7(``0,``1,``2,``3@,``4@,``5@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod6vvvrrr{``0,``1,``2,``3,``4,``5,``6})
P0:
P1:
P2:
P3:
P4:
P5:
Method:
Returns:

Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke6rrrrrr``7(``0@,``1@,``2@,``3@,``4@,``5@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod6rrrrrr{``0,``1,``2,``3,``4,``5,``6})
P0:
P1:
P2:
P3:
P4:
P5:
Method:
Returns: